[
  {
    "url": "https://www.pluralsight.com",
    "name": "Pluralsight",
    "raw_url": "https://www.pluralsight.com/paths/csharp?aid=701j0000002BGlGAAW&oid=&promo=&searchsegment=ppcnonbrand&utm_campaign=Courses-C&utm_medium=ppc&utm_source=google#-US-BMM&utm_content=&utm_term=&gclid=CNmbxqyr0dMCFdiNswodkyEJ5Q",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Python"],
    "type": ["MOOC"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 94,
    "letterLength": 629,
    "description": "Pluralsight helps organizations, teams, and individuals build better products with online courses and data-driven insights that fuel skill development and improve processes. We’re advancing the world’s tech workforce, and that starts with making your work more efficient and effective—and giving you more to celebrate. Learn AI Organizations we’ve ed: Why Pluralight? Whether you’m an individual looking to learn Python to advance your career or an enterprise team looking to cut cycle times, speed up onboarding, or give your teams the skills to realize your strategies, we remove the challenges and roadblocks slowing you down.",
    "trimmed_text": "TITLE: Online Courses, Learning Paths, and Certifications - Pluralsight || DESCRIPTION: Pluralsight helps organizations, teams, and individuals build better products with online courses and data-driven insights that fuel skill development and improve processes. || BODY: s 1298 Redirect Link Thank you! Our team will be in touch shortly. Loading form... If this message remains, it may be due to cookies being disabled or to an ad blocker. × Pluralsight empowers you to master AI onboard quicker deliver faster upgrade your skills build tech fluency upskill teams collaborate better stream processes innovate smarter Develop critical tech skills. Cut cycle times. Build happier, healthier tech teams. And innovate smarter using AI. All with Pluralsight. Learn AI Organizations we’ve ed: Why Pluralsight? Whether you’re an individual looking to learn Python to advance your career or an enterprise team looking to cut cycle times, speed up onboarding, or give your teams the skills to realize your strategies, we remove the challenges and roadblocks slowing you down. We’re advancing the world’s tech workforce, and that starts with making your work more efficient and effective—and giving you more to celebrate. See our solutions On demo See our solutions in action Check out our demos to see"
  },
  {
    "url": "https://www.udacity.com/",
    "name": "Udacity",
    "raw_url": "http://udacity.com",
    "length": 200,
    "category": ["Artificial Intelligence", "Data Science"],
    "techStack": ["Node.js"],
    "type": ["Hands-On Practice", "Project-Based"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 79,
    "letterLength": 575,
    "description": "Learn online and advance your career with courses in programming, data science, artificial intelligence, digital marketing, and more. Every course has real projects designed to develop the skills you need to reach your career goals. Prove Mastery Through Hands-On Projects Our open-ended projects are modeled after real-world workplace scenarios, and require in-depth critical thinking and creative solutions. Succeed with Personalized Every project receives personalized from industry experts, and our mentors are available to answer questions whenever you're feeling stuck.",
    "trimmed_text": "TITLE: Learn the Latest Tech Skills; Advance Your Career | Udacity || DESCRIPTION: Learn online and advance your career with courses in programming, data science, artificial intelligence, digital marketing, and more. Gain in-demand technical skills. Join today! || BODY: Cancel Cancel for Free Every course has real projects designed to develop the skills you need to reach your career goals Courses Recommended for You Courses Recommended for You New Releases New Releases Courses Courses Top AI & Data Skills Courses Top AI & Data Skills Courses Courses to Learn New Skills in 30 Days Courses to Learn New Skills in 30 Days The Udacity Difference Prove Mastery Through Hands-On Projects Our open-ended projects are modeled after real-world workplace scenarios, and require in-depth critical thinking and creative solutions. Succeed with Personalized Every project receives personalized from industry experts, and our mentors are available to answer questions whenever you're feeling stuck. Learners Love Udacity Udacity ed me gain on-the-job confidence, build a portfolio, and earn a microcredential to share with prospective employers. Ben, Business Analyst Nanodegree program graduate I started with the basics, completed a Nanodegree program, and gained so much experience. I'm now in a new Android job! Mahmoud, Android Developer"
  },
  {
    "url": "https://fullstackopen.com/en/",
    "name": "Fullstackopen",
    "raw_url": "https://fullstackopen.com/en",
    "length": 200,
    "category": ["Web Development", "FullStack Development"],
    "techStack": [
      "Javascript",
      "Typescript",
      "Mongodb",
      "Graphql",
      "Redux",
      "React.js",
      "Node.js"
    ],
    "type": ["MOOC"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 65,
    "letterLength": 452,
    "description": "Learn React, Redux, Node.js, MongoDB, GraphQL and TypeScript in one go! This course will introduce you to modern JavaScript-based web development. The main focus is on building single page applications with ReactJS. No more yearly versions, the course just continues without any break! See here for . You can discuss the course and related topics in our dedicated group on https://study.cs.helsinki.fi///fullstack and on : https://t.me/fullstackcourse.",
    "trimmed_text": "TITLE: Full stack open || DESCRIPTION: Open online course on JavaScript based modern web development by University of Helsinki and Houston Inc.. || BODY: {() => fs} Deep Dive Into Modern Web Development Full Stack open Start course Learn React, Redux, Node.js, MongoDB, GraphQL and TypeScript in one go! This course will introduce you to modern JavaScript-based web development. The main focus is on building single page applications with ReactJS that use REST APIs built with Node.js. Announcements Questions about the course? Read carefully Part 0 , that has an answer to most of them... No more yearly versions, the course just continues without any break! See here for . You can discuss the course and related topics in our dedicated group on https://study.cs.helsinki.fi///fullstack and on : https://t.me/fullstackcourse . Please the conversation! See here how to ask questions in a proper way Authors and License Parts 0-8 and 13 of the course material is written by Matti Luukkainen . The content of part 9 is written by developers from Terveystalo . Part 10 is written by Kalle Ilves . The content of part 11 is written by developers from Smartly and part 12 is by Jami Kousa . Numerous people"
  },
  {
    "url": "https://upskillcourses.com",
    "name": "Upskillcourses",
    "raw_url": "https://upskillcourses.com/p/essential-web-developer-course",
    "length": 200,
    "category": ["Sql"],
    "techStack": [
      "Javascript",
      "Ruby",
      "Php",
      "Rails",
      "Backbone",
      "React.js",
      "Vue.js",
      "Node.js",
      "HTML/CSS"
    ],
    "type": ["Video Courses", "Hands-On Practice", "Project-Based"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 88,
    "letterLength": 554,
    "description": "Learn fundamental and state-of-the-art programming skills using modern technologies. Over 130,000 students in 150 countries ♥ our courses. Our students get jobs and start companies. No boring lectures! We use a conversational style, like a friend showing you new skills. Learn By Building a Portfolio Many of our training videos are project-based - all of which will be added to your portfolio so you can impress employers or your clients with real-world apps. If there is not enough information about the website then return 'Need more details' instead.",
    "trimmed_text": "TITLE: Upskill || DESCRIPTION: N/A || BODY: Learn how to code from scratch. Premium Programming Courses Upskill is a high-quality tech training platform. Learn fundamental and state-of-the-art programming skills using modern technologies. New Content Added Regularly We're constantly adding courses on topics like JavaScript, HTML5 & CSS3, PHP & MySQL, Node.js, React, Vue, Backbone, Ruby on Rails, computer science fundamentals and more. Engaging Teaching Style From beginner to advanced, you can expect breadth and depth in our content. No boring lectures! We use a conversational style, like a friend showing you new skills. Learn By Building a Portfolio Many of our training videos are project-based - all of which will be added to your portfolio so you can impress employers or your clients with real-world apps. Over 130,000 students in 150 countries ♥ our courses. Our students get jobs and start companies. @robeendey Sir! You are the best instructor on the web! I am a fan :) — ⚡ (@TheTehseen) May 1, 2017 @robeendey hi, I start learning codes from your course for fun, but now I am thinking about become a real developer. Thank you so much! — sacori (@handmadegiftsfr) June 23, 2015 Marius Costache Just wanted to say"
  },
  {
    "url": "https://www.freecodecamp.org/",
    "name": "Freecodecamp",
    "raw_url": "http://www.freecodecamp.com",
    "length": 8,
    "category": ["Other"],
    "techStack": ["Other"],
    "type": ["Other"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 76,
    "letterLength": 473,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph. Ignore the incoherent sentences,any person names, any 'review-like' sentences, any incomplete sentences, and N/A. If there is not enough information about the website then return 'Need more details' instead of 'This is an example of what you can expect from this website' and 'What do you want to know about this website? Please share your feedback'",
    "trimmed_text": "TITLE: N/A || DESCRIPTION: N/A || BODY: N/A"
  },
  {
    "url": "https://learndjango.com",
    "name": "Learndjango",
    "raw_url": "https://learndjango.com/books/",
    "length": 142,
    "category": ["Other"],
    "techStack": ["Python", "Django", "Flask"],
    "type": ["Text-Based"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 84,
    "letterLength": 561,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph. Free tutorials and premium courses on building, testing, and deploying real-world web applications. Getting Started with Django: A comprehensive introduction to Django architecture, models, views, URLs, and templates. How to build a simple Hello, World application using Django. Flask vs Django (2024): A comparison of the two leading Python-based web frameworks. Custom User Model: Implement and add extra fields to a custom user model.",
    "trimmed_text": "TITLE: Home || DESCRIPTION: Free tutorials and premium courses on building, testing, and deploying real-world web\napplications. || BODY: Build Modern Web Applications with Python Free tutorials and premium courses on building, testing, and deploying real-world web applications. BROWSE ALL TUTORIALS Featured Tutorials Getting Started with Django A comprehensive introduction to Django architecture, models, views, URLs, and templates. Read now Django Hello, World How to build a simple Hello, World application using Django. Read now Django Tutorial How to build a basic application in Django using models, views, URLs, and templates. Read now Flask vs Django (2024) A comparison of the two leading Python-based web frameworks. Read now Django User Authentication Add , log out, , password reset, and password change to your site. Read now Custom User Model Implement and add extra fields to a custom user model. Read now Books"
  },
  {
    "url": "https://www.khanacademy.org",
    "name": "Khanacademy",
    "raw_url": "https://www.khanacademy.org/",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Javascript"],
    "type": ["MOOC"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 85,
    "letterLength": 593,
    "description": "Learn for free about math, art, computer programming, economics, physics, chemistry, biology, medicine, finance, history, and more. Khan Academy is a nonprofit with the mission of providing a free, world-class education for anyone, anywhere. With Khan Academy, teachers can identify gaps in their students’ understanding, tailor instruction, and meet the needs of every learner. For every student, every classroom. Real results. We’re a nonprofit. with the. mission to provide a free,. world- class education for everyone. Learners Teachers Parents Learners, teachers, and parents: Start here.",
    "trimmed_text": "TITLE: Khan Academy | Free Online Courses, Lessons & Practice || DESCRIPTION: Learn for free about math, art, computer programming, economics, physics, chemistry, biology, medicine, finance, history, and more. Khan Academy is a nonprofit with the mission of providing a free, world-class education for anyone, anywhere. || BODY: If you're seeing this message, it means we're having trouble loading external resources on our website. If you're behind a web filter, please make sure that the domains *.kastatic.org and *.kasandbox.org are unblocked. To and use all the features of Khan Academy, please enable JavaScript in your browser. Main content For every student, every classroom. Real results. We’re a nonprofit with the mission to provide a free, world-class education for anyone, anywhere. Learners Teachers Parents Learners, teachers, and parents: Start here Why Khan Academy works Personalized learning Students practice at their own pace, first filling in gaps in their understanding and then accelerating their learning. Trusted content Created by experts, Khan Academy’s library of trusted practice and lessons covers math, science, and more. Always free for learners and teachers. Tools to empower teachers With Khan Academy, teachers can identify gaps in their students’ understanding, tailor instruction, and meet the needs of every"
  },
  {
    "url": "https://www.codecademy.com/",
    "name": "Codecademy",
    "raw_url": "http://www.codecademy.com",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Javascript", "Python"],
    "type": ["Interactive Content"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 81,
    "letterLength": 533,
    "description": "This is a text of a website generated using scrapy. Please summarize the website into a concise, readable paragraph. Ignore the incoherent sentences,any person names, any 'review-like' sentences, any incomplete sentences, and N/A. If there is not enough information about the website then return 'Need more details' instead.TITLE: Learn to Code - for Free | Codecademy || DESCRIPTION: Learn the technical skills to get the job you want. Get personalized job listings and practice interview questions Assess your job-readiness with AI",
    "trimmed_text": "TITLE: Learn to Code - for Free | Codecademy || DESCRIPTION: Learn the technical skills to get the job you want. Join over 50 million people choosing Codecademy to start a new career (or advance in their current one). || BODY: Grid Regular Grid Regular THE GENERATION OF LEARNING Build skills quicker with AI assistance Gain experience with modern developer tools Build skills quicker with AI assistance Gain experience with modern developer tools Build skills quicker with AI assistance Gain experience with modern developer tools Build skills quicker with AI assistance Gain experience with modern developer tools Build skills quicker with AI assistance Gain experience with modern developer tools BUILD YOUR TECH CAREER Get personalized job listings and practice interview questions Assess your job-readiness with AI Get personalized job listings and practice interview questions Assess your job-readiness with AI Get personalized job listings and practice interview questions Assess your job- readiness with AI Get personalized job listings and practice interview questions Assess your job-readiness with AI Get personalized job listings and practice interview questions Assess your job-readiness with AI INTERACTIVE COURSES Learn Python, JavaScript, and more 400+ courses, paths, and case studies for all skill levels Learn Python, JavaScript, and"
  },
  {
    "url": "https://training.talkpython.fm",
    "name": "Talkpython",
    "raw_url": "https://training.talkpython.fm/courses/explore_pycharm/mastering-pycharm-ide",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Javascript", "Python", "Fastapi"],
    "type": ["Video Courses"],
    "hasCert": false,
    "cost": "Paid",
    "wordLength": 87,
    "letterLength": 516,
    "description": "Learn on Learn on-demand through high quality training videos. Our videos and additional resources are available 24/7 so you can learn what you need exactly when you need it. With our pay once, own it forever business model, you can rest assured that the courses you put time into become permanent resources for your career. Courses are written and presented by Michael Kennedy, the host of the Talk Python To Me podcast and professional trainer with over 10 years of experience. The Everything Course Bundle Are you",
    "trimmed_text": "TITLE: Talk Python Training - Python courses and tutorials for developers - [Talk Python Training] || DESCRIPTION: Best online Python courses from a trusted source from the folks who bring you the Talk Python To Me podcast. || BODY: Talk Python Training On video courses for Python developers Get notified about new courses and more our mailing list » Python for Absolute Beginners 7.2 hours of content , $49 HTMX + Flask: Modern Python Web Apps, Hold the JavaScript 3.0 hours of content , $39 Modern APIs with FastAPI and Python 3.9 hours of content , $39 See all our courses Learn on Learn on-demand through high quality training videos. Our videos and additional resources are available 24/7 so you can learn what you need exactly when you need it. Lifetime access With our pay once, own it forever business model, you can rest assured that the courses you put time into become permanent resources for your career. High quality On training from a source you can trust. Courses are written and presented by Michael Kennedy, the host of the Talk Python To Me podcast and professional trainer with over 10 years of experience. The Everything Course Bundle Are you"
  },
  {
    "url": "https://www.theodinproject.com",
    "name": "Theodinproject",
    "raw_url": "https://www.theodinproject.com/",
    "length": 200,
    "category": ["Databases", "Web Development", "FullStack Development"],
    "techStack": [
      "Javascript",
      "Ruby",
      "Rails",
      "React.js",
      "Node.js",
      "HTML/CSS"
    ],
    "type": ["Hands-On Practice", "Project-Based"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 105,
    "letterLength": 623,
    "description": "The Odin Project empowers aspiring web developers to learn together for free. Our full stack curriculum is free and ed by a passionate open source community. We scour the internet looking for only the best resources to supplement your learning and present them in a logical order. Learn everything you need to know Intermediate HTML and CSS Advanced HTML andCSS Databases NodeJS JavaScript Getting Hired React Ruby on Rails Ruby curriculum Success Stories Rob Pando TOP was a perfect match for my learning style. Not walking me through an entire project but actually forcing me to figure it out on my own, by pointing me...",
    "trimmed_text": "TITLE: Your Career in Web Development Starts Here | The Odin Project || DESCRIPTION: The Odin Project empowers aspiring web developers to learn together for free || BODY: Close Odin Your Career in Web Development Starts Here Our full stack curriculum is free and ed by a passionate open source community. View Full Curriculum How it works This is the website we wish we had when we were learning on our own. We scour the internet looking for only the best resources to supplement your learning and present them in a logical order. Learn Learn from a curriculum with the best curated on tutorials, s, and courses. Build Build dozens of portfolio-worthy projects along the way, from simple scripts to full programs and deployed websites. Connect You're not alone. Learn and get from our friendly community of beginner and experienced developers. Learn everything you need to know Intermediate HTML and CSS Advanced HTML and CSS Databases NodeJS JavaScript Getting Hired React Ruby on Rails Ruby curriculum Success Stories Rob Pando TOP was a perfect match for my learning style. Not walking me through an entire project but actually forcing me to figure it out on my own, by pointing me..."
  },
  {
    "url": "https://frontendmasters.com/",
    "name": "Frontendmasters",
    "raw_url": "https://frontendmasters.com/",
    "length": 200,
    "category": [
      "Software Engineering",
      "Web Development",
      "FullStack Development",
      "Frontend Development",
      "Backend Development",
      "Software Development"
    ],
    "techStack": [
      "Javascript",
      "Go",
      "Typescript",
      "React.js",
      "Vue.js",
      "Node.js"
    ],
    "type": ["Interactive Content"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 82,
    "letterLength": 511,
    "description": "Learn JavaScript, React, and TypeScript to Node.js, Fullstack, and Backend | Frontend Masters. 200+ In- depth Frontend & Fullstack Courses. Learn Practical Tech Skills from Experts You Can Trust. Popular Learning Paths: Beginner • Professional • Fullstack. Back to Mail Online home. Back To the page you came from. This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph, highlighting what the website is about, what it does and what it offers.",
    "trimmed_text": "TITLE: Learn JavaScript, React, and TypeScript to Node.js, Fullstack, and Backend | Frontend Masters || DESCRIPTION: Advance your web development and software engineering skills from front-end to full-stack! || BODY: Your Path to Senior Developer and Beyond 200+ In-Depth Frontend & Fullstack Courses Browse Our Courses View Learning Paths Learn Practical Tech Skills from Experts You Can Trust With over 200 courses in JavaScript, React, and TypeScript to Node.js, Fullstack, and Backend JavaScript React TypeScript Fullstack to Backend Node.js .js Go Vue Angular Popular Learning Paths: Beginner • Professional • Fullstack Why Frontend Masters? At Frontend Masters, we pride ourselves on offering courses designed and taught by leading experts actively employing their skills at renowned companies such as Netflix, Spotify, Google, and Stripe. Our curriculum is continually refreshed to align with the most recent advancements, guaranteeing that our learners are equipped with industry-standard best practices and cutting-edge techniques. Browse Our Courses View Learning Paths Not sure where to ? Try the Learning Path Quiz 200+ In-Depth Courses 18 Learning Paths Industry Leading Experts Live Interactive Workshops What They're Saying I'm truly impressed with the quality of the instructors, top-notch! Also, the casual tone of the course is great because it's"
  },
  {
    "url": "https://missing.csail.mit.edu",
    "name": "Mit",
    "raw_url": "https://missing.csail.mit.edu](https://missing.csail.mit.edu/?fbclid=IwAR1NEIiwwk-e2k3ykSTrxF5YkrLshitO3ZK_BlnbtG9_FWtpu2Vb0w78OZY",
    "length": 200,
    "category": ["Machine Learning", "Operating Systems"],
    "techStack": ["Less"],
    "type": ["Other"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 79,
    "letterLength": 506,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph. Ignore the incoherent sentences,any person names, any 'review-like' sentences, any incomplete sentences, and N/A. If there is not enough information about the website then return 'Need more details' instead. The Missing Semester of Your CS Education will teach you how to master the command-, use a powerful text editor, use fancy features of version control systems, and much more.",
    "trimmed_text": "TITLE: The Missing Semester of Your CS Education || DESCRIPTION: N/A || BODY: The Missing Semester of Your CS Education Classes teach you all about advanced topics within CS, from operating systems to machine learning, but there’s one critical subject that’s rarely covered, and is instead left to students to figure out on their own: proficiency with their tools. We’ll teach you how to master the command-, use a powerful text editor, use fancy features of version control systems, and much more! Students spend hundreds of hours using these tools over the course of their education (and thousands over their career), so it makes sense to make the experience as fluid and frictionless as possible. Mastering these tools not only enables you to spend less time on figuring out how to bend your tools to your will, but it also lets you solve problems that would ly seem impossibly complex. Read about the motivation behind this class . Schedule 1/13/20 : Course overview + the shell 1/14/20 : Shell Tools and Scripting 1/15/20 : Editors (Vim) 1/16/20 : Data Wrangling 1/21/20 : Command- Environment 1/22/20 : Version Control (Git) 1/23/20 : Debugging and Profiling 1/27/20 : Metaprogramming 1/28/20 : Security"
  },
  {
    "url": "https://projectlearn.io",
    "name": "Projectlearn",
    "raw_url": "https://projectlearn.io/",
    "length": 124,
    "category": [
      "Artificial Intelligence",
      "Machine Learning",
      "Web Development",
      "Mobile Development",
      "Game Development"
    ],
    "techStack": [
      "Javascript",
      "Python",
      "C#",
      "Flutter",
      "React.js",
      "HTML/CSS"
    ],
    "type": ["Video Courses", "Hands-On Practice", "Project-Based"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 77,
    "letterLength": 579,
    "description": "ProjectLearn is a project-based learning approach in web development, mobile development, game development, machine learning and artificial intelligence. Do project based learning and learn code the right way! Start Building Contribute Categories Web Development Build web applications using HTML, CSS, JavaScript, React. Mobile Development Build mobile applications using Android, Flutter, React Native and more. Game Development Build awesome video games. Machine Learning Learn how a machine learns. Get notified about new updates! 2023 ProjectLearn About Contribution Guides.",
    "trimmed_text": "TITLE: ProjectLearn - Learn to Code by Creating Projects || DESCRIPTION: A project-based learning approach in web development, mobile development, game development, machine learning and artificial intelligence. Learn code the right way! || BODY: ProjectLearn.io Learn By Doing Tutorials are great, but building projects is the best way to learn. Do project based learning and learn code the right way! Start Building Contribute Categories Web Development Build web applications using HTML, CSS, JavaScript, React and more. Mobile Development Build mobile applications using Android, Flutter, React Native and more. Game Development Build awesome video games. C#, PyGame, OpenGL, Unity and more. Machine Learning Learn how a machine learns. Python, NumPy, Pandas, SciKit, Tensorflow and more. Get notified about new updates! 2023 ProjectLearn About Contribution Guides"
  },
  {
    "url": "https://learnxinyminutes.com",
    "name": "Learnxinyminutes",
    "raw_url": "https://learnxinyminutes.com/",
    "length": 200,
    "category": ["Other"],
    "techStack": ["C++", "C#", "HTML/CSS"],
    "type": ["Other"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 59,
    "letterLength": 347,
    "description": "This is a text of a website generated using scrapy. Highlight your language: en-us ar-ar be-by bg-bg ca-es cs-cz de-de el-gr es-es fa-ir fi-fi fr-fr he-he hi-in hu-hu id-id it-it ja-jp ko-kr lt-lt ms-my nl-nl no-nb pl-pl pt-br pt-pt ro-ro ru-ru sk-sk sl-si sv-se ta-in th-th tr-tr uk-ua vi-vn zh-cn zh -tw Select theme: light dark Take a whirlwind",
    "trimmed_text": "TITLE: Learn X in Y Minutes: Scenic Programming Language Tours || DESCRIPTION: N/A || BODY: Learn X in Y minutes Highlight your language: en-us ar-ar be-by bg-bg ca-es cs-cz de-de el-gr es-es fa-ir fi-fi fr-fr he-he hi-in hu-hu id-id it-it ja-jp ko-kr lt-lt ms-my nl-nl no-nb pl-pl pt-br pt-pt ro-ro ru-ru sk-sk sl-si sv-se ta-in th-th tr-tr uk-ua vi-vn zh-cn zh-tw Select theme: light dark Take a whirlwind tour of your favorite language. Community-driven! Languages Translations Ada APL arturo asciidoc ca-es de-de es-es id-id it-it ja-jp pt-br sl-si zh-cn AssemblyScript ATS Ballerina bc de-de pt-br bf cs-cz de-de es-es fa-ir fr-fr id-id it-it ko-kr nl-nl pl-pl pt-br pt-pt ro-ro ru-ru sv-se tr-tr zh-cn BQN C de-de es-es fr-fr pt-br ru-ru tr-tr uk-ua zh-cn C# de-de es-es fr-fr pt-br tr-tr zh-cn C++ de-de es-es fr-fr hi-in it-it pt-br ru-ru tr-tr zh-cn chapel es-es CHICKEN clojure de-de es-es fr-fr ko-kr ms-my pt-br pt-br ro-ro ru-ru tr-tr zh-cn clojure macros de-de ko-kr ms-my zh-cn COBOL zh-cn coffeescript de-de es-es fr-fr hu-hu id-id it-it ko-kr ms-my nl-nl pt-br ro-ro ru-ru sk-sk zh-cn coldfusion es-es Common Lisp es-es ko-kr ms-my pt-br ru-ru zh-cn Coq crystal de-de fr-fr ru-ru zh-cn css cs-cz de-de el-gr es-es fa-ir"
  },
  {
    "url": "https://v2.scrimba.com/",
    "name": "Scrimba",
    "raw_url": "https://scrimba.com/learn/learnreact",
    "length": 8,
    "category": ["Other"],
    "techStack": ["Other"],
    "type": ["Other"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 75,
    "letterLength": 479,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph. Ignore the incoherent sentences,any person names, any 'review-like' sentences, any incomplete sentences, and N/A. If there is not enough information about the website then return 'Need more details' instead of 'This is an example of what you can expect from this website' and 'Please share more information about this website with your friends and family'",
    "trimmed_text": "TITLE: Home || DESCRIPTION: N/A || BODY: N/A"
  },
  {
    "url": "https://www.frontendmentor.io",
    "name": "Frontendmentor",
    "raw_url": "https://www.frontendmentor.io/challenges/insure-landing-page-uTU68JV8/intro",
    "length": 200,
    "category": ["Frontend Development"],
    "techStack": ["Javascript", "R", "HTML/CSS"],
    "type": [
      "Text-Based",
      "Hands-On Practice",
      "Project-Based",
      "Coding Practice"
    ],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 83,
    "letterLength": 551,
    "description": "Frontend Mentor helps you improve your front-end skills by building real projects. Solve real-world HTML, CSS and JavaScript challenges whilst working to professional designs. You can sharpen your skills building websites and add finished projects to your portfolio to land a job. With GitHub 837,756 developers building projects, reviewing code, and ing each other improve. Unlock Pro with GitHub. Looking to hire developers? Visit our Hiring Platform Learning paths Challenges Solutions Articles Unlock Pro on GitHub. Back to the page you came from.",
    "trimmed_text": "TITLE: Frontend Mentor | Front-end coding challenges using a real-life workflow || DESCRIPTION: Improve your front-end skills by building real projects. Solve real-world HTML, CSS and JavaScript challenges whilst working to professional designs. || BODY: Looking to hire developers? Visit our Hiring Platform Learning paths Challenges Solutions Articles Unlock Pro with GitHub Improve your coding skills by building realistic projects Our professionally designed challenges you gain hands-on experience writing HTML, CSS, and JavaScript. We create the designs so you can focus on the code and see your skills skyrocket! with GitHub 837,756 developers building projects, reviewing code, and ing each other improve. Testimonials I highly recommend Frontend Mentor. Skip the for project ideas and dive into ready-made challenges that you level up as a developer. Kevin Powell Web Developer & r Frontend Mentor is a win-win. You can sharpen your skills building websites and add finished projects to your portfolio to land a job! Jessica Chan Web Developer & r As featured on... Why Frontend Mentor? 😈 Escape tutorial hell Add projects to your learning journey and put your knowledge to the test. The real learning happens when you start solving real-world problems yourself. 🤩 Build portfolio-worthy projects Design is"
  },
  {
    "url": "https://ui.dev",
    "name": "Ui.Dev",
    "raw_url": "https://Ui.Dev",
    "length": 190,
    "category": ["Other"],
    "techStack": ["Javascript", "React.js"],
    "type": ["Other"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 72,
    "letterLength": 463,
    "description": "This is a text of a website generated using scrapy. If there is not enough information about the website then return 'Need more details' instead.Please summarize the following text into a concise, readable paragraph. Ignore the incoherent sentences,any person names, any 'review-like' sentences, any incomplete sentences, and N/A. If you need more information about a website, please visit ui.dev to learn more about how to create a website using the Scrapy tool.",
    "trimmed_text": "TITLE: ui.dev | JavaScript, but fun. || DESCRIPTION: We help JavaScript developers make more money - and enjoy themselves in the process. || BODY: Welcome, Friend Stuck in tutorial h*ck? You’ve come to the right place. We make learning the JavaScript ecosystem fun, approachable, and easy... Shut up and take my money Simon Vrachliotis React Hooks “I already knew React hooks, but this course really consolidated my understanding of them. I teach React training workshops myself, and after taking this course, my confidence in talking about hooks is much stronger.” Kellee Martins Advanced JavaScript “Mind blown. Every other moment a light bulb was going off in my head. Without a traditional CS background sometimes it can be hard to wrap my head around ‘why’ things are done. This really bridged some huge gaps for me. Fabulous, well done.” Faraz Ahmad Advanced JavaScript “I was a scrub before I discovered ui.dev. I used their Advanced JavaScript course to prepare for interviews and landed a job at Netflix. All their courses are bangers.” s: Apple, Netflix, Microsoft, Netlify, Uber, Tesla, Amazon, Spotify You’ll be in great company with other developers we’ve trained"
  },
  {
    "url": "https://dribbble.com",
    "name": "Dribbble",
    "raw_url": "https://dribbble.com/",
    "length": 200,
    "category": ["UI Design", "UX Design"],
    "techStack": ["Other"],
    "type": ["Other"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 72,
    "letterLength": 467,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph. Ignore the incoherent sentences,any person names, any 'review-like' sentences, any incomplete sentences, and N/A. If there is not enough information about the website then return 'Need more details' instead of the text. The world’s destination for design Get inspired by the work of millions of top-rated designers & agencies around the world.",
    "trimmed_text": "TITLE: Dribbble - Discover the World’s Top Designers & Creative Professionals || DESCRIPTION: Find Top Designers & Creative Professionals on Dribbble. We are where designers gain inspiration, feedback, community, and jobs. Your best resource to discover and connect with designers worldwide. || BODY: Dribbble: the community for graphic design Over 3 million ready-to-work creatives! The world’s destination for design Get inspired by the work of millions of top-rated designers & agencies around the world. Helen Tran Lead Product Designer Leadership Product UX Aurélien Salomon Design Director Mobile Product UX Andrea Jelić Digital Designer Brand UI Web Daniele Buffa Principal Designer Animation UI Visual Lilla Bardenova Brand + Illustrator Brand Illustration Web Elif Kameşoğlu Brand Designer Brand Illustration Web Vladimir Gruev Digital Designer Brand Design Mercedes Bazan Illustrator Graphic Design Illustration Chris Owens Creative Director Illustration Mobile UI Jesse Showalter Design Educator UI Web Mobile Dan Mall Design Educator Product UX Victa Wille Digital Designer Mobile UI Web Helen Tran Lead Product Designer Leadership Product UX Aurélien Salomon Design Director Mobile Product UX Andrea Jelić Digital Designer Brand UI Web Daniele Buffa Principal Designer Animation UI Visual Lilla Bardenova Brand + Illustrator Brand Illustration Web Elif Kameşoğlu Brand Designer Brand Illustration"
  },
  {
    "url": "https://phptherightway.com/",
    "name": "Phptherightway",
    "raw_url": "http://www.phptherightway.com/",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Php"],
    "type": ["Coding Practice"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 81,
    "letterLength": 532,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph, highlighting what the website is about, what it does, and what it offers. Ignore the incoherent sentences,any person names, any 'review-like' sentences, any incomplete sentences, and N/A. If there is not enough information about the website then return 'Need more details' instead of 'This is an easy-to-read, quick reference for PHP popular coding standards, links to authoritative tutorials around the Web'",
    "trimmed_text": "TITLE: PHP: The Right Way || DESCRIPTION: An easy-to-read, quick reference for PHP best practices, accepted coding standards, and links to authoritative PHP tutorials around the Web || BODY: PHP The Right Way Last Updated: 2024-06-04 08:45:17 +0000 Share on Welcome There’s a lot of outdated information on the Web that leads new PHP users astray, propagating bad practices and insecure code. PHP: The Right Way is an easy-to-read, quick reference for PHP popular coding standards, links to authoritative tutorials around the Web, and what the contributors consider to be best practices at present. There is no canonical way to use PHP . This website aims to introduce new PHP developers to some topics which they may not discover until it is too late, and aims to give seasoned pros some fresh ideas on those topics they’ve been doing for years without ever reconsidering. This website will also not tell you which tools to use, but instead offer suggestions for multiple options, when possible explaining the differences in approach and use-case. This is a living document and will continue to be updated with more ful information and examples as they become available. Translations PHP: The Right Way is translated into"
  },
  {
    "url": "https://codewithmosh.com",
    "name": "Codewithmosh",
    "raw_url": "https://codewithmosh.com/p/mastering-react",
    "length": 200,
    "category": ["Software Development"],
    "techStack": ["React.js", "Node.js"],
    "type": ["Coding Practice"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 84,
    "letterLength": 497,
    "description": "Code with Mosh teaches you how to become the software engineer that companies love to hire. All the coding courses you need to excel in one place. (Free) 10M+ Students taught 3M+ fans 20+ Years of experience 51 Coding courses Features Why Code With Mosh? Fast-track your learning No fluff, just the good stuff! I don't want to waste your time with boring stuff you don't need. No rambling or repetition. Just the essentials you needs to succeed, explained in plain English. Easy-to-follow lessons.",
    "trimmed_text": "TITLE: Code with Mosh || DESCRIPTION: Become the software engineer that companies love to hire. || BODY: Become the software engineer that companies love to hire All the coding courses you need to excel in one place. (Free) const coder = { name: ' Master Coder ', skills: [' React ', ' Node '], hardWorker: true , problemSolver: true , hireable: function () { return ( this. hardWorker && this. problemSolver && this. skills.length >= 5 ); } } Hello, I'm Mosh Hamedani. Are you feeling stuck or overwhelmed in your coding journey? Don't worry, I've got your back! Together, we'll work to level up your skills, increase your earning potential, and build a brighter future. 10M+ Students taught 3M+ fans 20+ Years of experience 51 Coding courses Features Why Code with Mosh? Fast-track your learning No fluff, just the good stuff! I don't want to waste your time with boring stuff you don't need. So I've made sure my courses are clear, concise, to the point, and free of technical jargon. No rambling or repetition, just the essentials you need to succeed, explained in plain English. Step-by-step lessons Easy-to-follow lessons I know learning to code can be tough. So"
  },
  {
    "url": "https://landing.runestone.academy",
    "name": "Runestone",
    "raw_url": "https://runestone.academy/runestone/books/published/thinkcspy/index.html",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Other"],
    "type": ["Text-Based", "Interactive Content", "Coding Practice"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 77,
    "letterLength": 489,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph. If there is not enough information about the website then return 'Need more details' instead of the text.TITLE: Free Online Textbooks for Math and Computer Science - Runestone Academy || DESCRIPTION: N/A || BODY: Donate Math Textbooks CS Textbooks News Instructors Free On Textbook for Math & Computer Science. Learn math and computer science with Runstone Academy.",
    "trimmed_text": "TITLE: Free Online Textbooks for Math and Computer Science - Runestone Academy || DESCRIPTION: N/A || BODY: Donate Math Textbooks CS Textbooks News Instructors Free On Textbooks for Math and Computer Science Learn math and computer science with Runestone Academy Register & Navigation link 1 Navigation link 2 Navigation link 3 Our mission is to equip the nation’s STEM teachers with open-source content, tools and strategies they need to create engaging, accessible, and effective learning experiences for their students Runestone Academy offers a wide range of free on textbooks for math and computer science. Whether you are a student, teacher, or self-learner, our textbooks provide comprehensive and interactive resources to you master these subjects. With clear explanations, engaging examples, and interactive exercises, learning math and computer science has never been easier. our textbooks today and start your learning journey with Runestone Academy. Interactive Textbook exercises Student “I liked how everything was on Runestone and there was one platform for all of the preview problems, notes, solutions, and work assignments. It's easy and convenient.” “Runestone was definitely superior to other platforms. Being able to open the problems up in the textbook and do them there instead of a different website really"
  },
  {
    "url": "https://pythonprogramming.net",
    "name": "Pythonprogramming",
    "raw_url": "https://pythonprogramming.net/",
    "length": 200,
    "category": [
      "Machine Learning",
      "Robotics",
      "Data Analysis",
      "Web Development",
      "Game Development",
      "Software Development"
    ],
    "techStack": ["Python", "Go", "Django", "Flask"],
    "type": ["Video Courses"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 84,
    "letterLength": 525,
    "description": "Learn how to use Python with Pandas, Matplotlib, and other modules to gather insights from and about your data. Learn the basics and concepts of working with quantum computers and qubits through practical applications and the Qiskit package. Start Game Development Create your own games with Python's PyGame library, or check out the multi-platform Kivy. How to develop websites with either the Flask or Django frameworks for Python. Creating various software bots, like bots in games, in chats, and to interact with the web.",
    "trimmed_text": "TITLE: Python Programming Tutorials || DESCRIPTION: Python Programming tutorials from beginner to advanced on a massive variety of topics. All video and text tutorials are free. || BODY: Machine Learning Employ both supervised and unsupervised machine learning, to make predictions or to understand data. View Data Analysis Learn how to use Python with Pandas, Matplotlib, and other modules to gather insights from and about your data. View Quantum Computer Programming Learn the basics and concepts of working with quantum computers and qubits through practical applications and the Qiskit package. Start Game Development Create your own games with Python's PyGame library, or check out the multi-platform Kivy. View Python Fundamentals Learn the basic and intermediate Python fundamentals. View Web Development How to develop websites with either the Flask or Django frameworks for Python. View Bots & AI Creating various software bots, like bots in games, in chats, and to interact with the web. Not to be confused with robotics! View Robotics Control hardware with Python programming and the Raspberry Pi. View GUIs Create software with a user interface using Tkinter, PyQt, or Kivy. View Golang Go is a programming language aimed at being simple, easy to work with, and capable of"
  },
  {
    "url": "https://www.engineer4free.com/",
    "name": "Engineer4free",
    "raw_url": "http://www.engineer4free.com/cplusplus",
    "length": 200,
    "category": ["Project Management", "Software Development"],
    "techStack": ["Other"],
    "type": ["Video Courses", "Hands-On Practice", "Project-Based"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 81,
    "letterLength": 515,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph. Ignore the incoherent sentences,any person names, any 'review-like' sentences, any incomplete sentences, and N/A. If there is not enough information about the website then return 'Need more details' Instead of the text below, please use the form below to help students with reading comprehension and vocabulary. Use the weekly Newsquiz to test your knowledge of stories you saw on this site.",
    "trimmed_text": "TITLE: Engineer4Free: The #1 Source for Free Engineering Tutorials - Home || DESCRIPTION: The #1 source for free engineering tutorials. Engineer4Free is a free tutorial site where anyone can learn university level math, science, and engineering subjects. Learn civil, mechanical, chemical, software, and more engineering skills today! || BODY: LEarn Engineering For Free About Engineer4Free Engineer4Free is a tutorial site where anyone can learn university level engineering for free. Engineer4Free has made hundreds of tutorials and organized them into several courses ranging from Calculus to Project Management to Structural Analysis. Whether you're cramming at 3AM, reviewing for the FE exam, or just life-long-learning, you've come to the right place. Subjects Tutorials Lessons Delivered What People Are Saying IT'S SO OBVIOUS NOW. This must be what an epiphany feels like. Thank you so much! I struggled with titrations for such a long time, and I finally get it! I'm definitely going to ace this on my final! ﻿ Great video, I got the same kind of question in my examination and I nailed it. Thanks a lot! Explained the ideas behind it well, rather than just throwing numbers and formulas at me like my lecturers... Thank you sooo much! This actually"
  },
  {
    "url": "https://www.coursera.org",
    "name": "Coursera",
    "raw_url": "http://www.coursera.com",
    "length": 200,
    "category": ["Cybersecurity", "UX Design"],
    "techStack": ["Other"],
    "type": ["Text-Based", "Hands-On Practice", "Project-Based", "MOOC"],
    "hasCert": true,
    "cost": "Free",
    "wordLength": 80,
    "letterLength": 491,
    "description": "Learn new job skills in online courses from industry leaders like Google, IBM, & Meta. Advance your career with top degrees from Michigan, Penn, Imperial & more. Unlock Google AI Essentials at no cost Build the skills you need for a new career—and power them up with AI. Enroll in a Google Professional Certificate and get Google AIEssentials atNo cost. Claim offer certificates We collaborate with 325+ leading universities and companies. Find your New Career for Free Learn without limits.",
    "trimmed_text": "TITLE: Coursera | Degrees, Certificates, & Free Online Courses || DESCRIPTION: Learn new job skills in online courses from industry leaders like Google, IBM, & Meta. Advance your career with top degrees from Michigan, Penn, Imperial & more. || BODY: For Individuals For Businesses For Universities For Governments On Degrees Find your New Career for Free Learn without limits Unlock Google AI Essentials at no cost Build the skills you need for a new career—and power them up with AI. Enroll in a Google Professional Certificate and get Google AI Essentials at no cost.* Claim offer certificates We collaborate with 325+ leading universities and companies Launch a new career in as little as 6 months roles Data Analyst Project Manager Digital Marketer IT Specialist Bookkeeper Cybersecurity Front-End Developer UX Designer Data Analyst Collect, organize, and transform data to make informed decisions Median Salary All occupations $37,960 * Data Analyst $90,500 ** Job openings: 82,489 ** Projected 10 year growth: + 13 % *** \"For anyone starting out as a data analyst, this is a great introduction and is very inspiring. The content was well paced and was accessible to people just starting out. I liked the variety of the assignments"
  },
  {
    "url": "https://www.mooc.fi/en/",
    "name": "Mooc",
    "raw_url": "http://mooc.fi/courses/2013/programming-part-1/",
    "length": 175,
    "category": ["Artificial Intelligence"],
    "techStack": ["Other"],
    "type": ["MOOC"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 71,
    "letterLength": 474,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph. Ignore the incoherent sentences,any person names, any 'review-like' sentences, any incomplete sentences, and N/A. If there is not enough information about the website then return 'Need more details' instead.TITLE: Home - MOOC.fi || DESCRIPTION: N/a || BODY: To main content University of Helsinki en MOOCfi High-quality and open courses for everyone!",
    "trimmed_text": "TITLE: Home - MOOC.fi || DESCRIPTION: N/A || BODY: To main content University of Helsinki en MOOC.fi High-quality and open courses for everyone! The courses are hosted by University of Helsinki MOOC Center. No prior knowledge is required — beginners can start to learn programming basics from the Introduction to Programming course, or start to get familiar with artificial intelligence from the course Elements of AI. Our courses Open courses for all On learning at its best. Don't worry about course fees or the commute. Study where it's convenient for you! As per their name, MOOCs (Massive Open On Course) are all open and fully available on. Courses and Modules Teach courses in your own classroom. Teacher! You can have your own courses, with point lists and schedules tailored for you. Some of our courses can be used for your classes for free with some customization for your needs, for example by setting your own deads. For more information, see our teacher's manual! For teachers Popular courses Show all courses Study modules Show all modules"
  },
  {
    "url": "https://www.sololearn.com/en/",
    "name": "Sololearn",
    "raw_url": "https://www.sololearn.com/",
    "length": 200,
    "category": ["Sql", "Web Development"],
    "techStack": [
      "Javascript",
      "Python",
      "Java",
      "C++",
      "C#",
      "Go",
      "Sql",
      "HTML/CSS"
    ],
    "type": ["Hands-On Practice", "Interactive Content", "Coding Practice"],
    "hasCert": true,
    "cost": "Free",
    "wordLength": 75,
    "letterLength": 479,
    "description": "Learn the latest technology with interactive, hands-on courses. No matter your experience level, you'll be writing real, functional code within minutes of starting your first course. Assess what you've learned with in-lesson quizzes, and gradually advance your skills with practice. Earn a certificate to validate your newly acquired skills. Post it on social for others to see. Become certified Learn anywhere, anytime On the web or on the go, Sololearn is always ready to help.",
    "trimmed_text": "TITLE: Sololearn: Learn to Code || DESCRIPTION: Join Now to learn the basics or advance your existing skills || BODY: New course! Every coder should learn Generative AI! Try a free lesson Learning to code got simplified. Learn the latest technology with interactive, hands-on courses. It’s free. with Google or options Choose a course for you Generative AI in Practice Web Development Python Developer Coding Foundations Coding for Data Front-end for Beginners Introduction to Python Introduction to C Introduction to C# Introduction to SQL Introduction to HTML Introduction to Java C# Intermediate Introduction to C++ Tech for Everyone Java Intermediate JavaScript Intermediate C++ Intermediate SQL Intermediate Angular Introduction to CSS Introduction to JavaScript Python Intermediate C Intermediate Tailored to you No matter your experience level, you'll be writing real, functional code within minutes of starting your first course. Start learning Bite-sized Go step-by-step through our unique courses. Assess what you've learned with in-lesson quizzes, and gradually advance your skills with practice. Do a quick lesson Get proof Earn a certificate to validate your newly acquired skills. Post it on social for others to see. Become certified Learn anywhere, anytime On the web or on the go, Sololearn is always ready"
  },
  {
    "url": "https://pll.harvard.edu/",
    "name": "Harvard",
    "raw_url": "https://pll.harvard.edu/course/cs50-introduction-computer-science?delta=0",
    "length": 200,
    "category": ["Data Science"],
    "techStack": ["Other"],
    "type": ["Other"],
    "hasCert": true,
    "cost": "Free",
    "wordLength": 81,
    "letterLength": 587,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph. Ignore the incoherent sentences,any person names, any 'review-like' sentences, any incomplete sentences, and N/A. If there is not enough information about the website then return 'Need more details' instead of the original text.TITLE: Professional and Lifelong Learning | Harvard University || DESCRIPTION: Explore professional and lifelong learning courses from Harvard University. Earn certificates for professional development or receive college degree credit.",
    "trimmed_text": "TITLE: Professional and Lifelong Learning | Harvard University || DESCRIPTION: Explore professional and lifelong learning courses from Harvard University. From free online literature classes to in-person business courses for executives, there’s something for everyone. Earn certificates for professional development, receive college degree credit, or take a class just for fun! Advance your career. Pursue your passion. Keep learning. || BODY: Professional and Lifelong Learning In-person, blended, and on courses All courses On Courses Free Courses Featured Health & Medicine On Digital Health the opportunities and difficulties facing widespread adoption of digital technologies in health care. Price $1,600 Duration 4 weeks long Registration Dead Register by Jul 29 Business On Managing Happiness Happiness is within your control. Write your own ending. Price Free * Duration 6 weeks long Registration Dead Available now Business On Strategy Execution for Public Leadership Harvard Kennedy School faculty and former Pentagon Chief of Staff Eric Rosenbach to learn how to develop strategies for public leadership success. Price $1,600 Duration 4 weeks long Registration Dead Register by Aug 12 Subject Areas Art & Design Business Computer Science Data Science Education & Teaching Health & Medicine Humanities Mathematics Programming Science Social Sciences Theology courses Courses Humanities On The"
  },
  {
    "url": "https://www.learncpp.com",
    "name": "Learncpp",
    "raw_url": "https://www.learncpp.com/",
    "length": 200,
    "category": ["Other"],
    "techStack": ["C++"],
    "type": ["Other"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 85,
    "letterLength": 517,
    "description": "LearnCpp.com is a free website devoted to teaching you how to program in modern C++. The lessons on this site will walk you through all the steps needed to write, compile, and debug your C++ programs. No prior programming experience is necessary, but programmers of all levels will benefit from our best practices, tips, and insights. This is a text of a website generated using scrapy.Please summarize the following text into a concise, readable paragraph, highlighting what the website is about, and what it offers.",
    "trimmed_text": "TITLE: Learn C++ – Skill up with our free tutorials || DESCRIPTION: N/A || BODY: Learn C++ Skill up with our free tutorials The C++ Tutorial LearnCpp.com is a free website devoted to teaching you how to program in modern C++. The lessons on this site will walk you through all the steps needed to write, compile, and debug your C++ programs. No prior programming experience is necessary, but programmers of all levels will benefit from our best practices, tips, and insights. Becoming an expert won’t happen overnight, but with a bit of patience, you’ll get there. And LearnCpp.com will show you the way. Chapter 0 Introduction / Getting Started 0.1 Introduction to these tutorials 0.2 Introduction to programming languages 0.3 Introduction to C/C++ 0.4 Introduction to C++ development 0.5 Introduction to the compiler, linker, and libraries 0.6 Installing an Integrated Development Environment (IDE) 0.7 Compiling your first program 0.8 A few common C++ problems 0.9 Configuring your compiler: Build configurations 0.10 Configuring your compiler: Compiler extensions 0.11 Configuring your compiler: Warning and error levels 0.12 Configuring your compiler: Choosing a language standard 0.13 What language standard is my compiler using? Chapter 1 C++ Basics 1.1 Statements and the structure"
  },
  {
    "url": "https://www.pluralsight.com/codeschool",
    "name": "Codeschool",
    "raw_url": "https://www.codeschool.com/",
    "length": 200,
    "category": ["Other"],
    "techStack": ["R"],
    "type": ["Interactive Content"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 74,
    "letterLength": 483,
    "description": "Grow your skills with code courses, assessments, paths and expert-led content on today’s most in-demand technologies. Already a Code School r? Your Code School experience has been automatically moved to the Pluralsight platform. Start a 10-day FREE trial Start a team trial Skill assessments Validate your skills and uncover knowledge gaps in today's most popular technologies. If there is not enough information about the website then return 'Need more details' instead of the text.",
    "trimmed_text": "TITLE: Pluralsight + Code School: Code Courses | Pluralsight || DESCRIPTION: We've integrated the interactivity from Code School into the Pluralsight platform. Grow your skills with code courses, assessments, paths and expert-led content on today’s most in-demand technologies. || BODY: s 1298 Redirect Link Thank you! Our team will be in touch shortly. Loading form... If this message remains, it may be due to cookies being disabled or to an ad blocker. × Already a Code School r? Your Code School experience has been automatically moved to the Pluralsight platform. If you are an individual Code School r, please . If you are a Code School teams r, please @pluralsight.com to access your account. Already a Code School r? Your Code School experience has been automatically moved to the Pluralsight platform. If you are an individual Code School r, please . If you are a Code School teams r, please @pluralsight.com to access your account. Code School + Pluralsight CodeSchool.com is now Pluralsight. Grow your skills with experiences like assessments, paths, code courses and expert-led content on today’s most in-demand technologies. Start a 10-day FREE trial Start a team trial Skill assessments Validate your skills and uncover knowledge gaps in"
  },
  {
    "url": "https://www.composingprograms.com/",
    "name": "Composingprograms",
    "raw_url": "https://www.composingprograms.com/",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Python"],
    "type": ["Hands-On Practice", "Project-Based"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 95,
    "letterLength": 615,
    "description": "Composing Programs is a free on introduction to programming and computer science. This text focuses on methods for abstraction, programming paradigms, and techniques for managing the complexity of large programs. These concepts are illustrated primarily using the Python 3 programming language. In addition to reading the chapters below, you can apply your knowledge to the programming projects that accompany the text and visualize program execution using the On Python Tutor. If you are interested in adapting any of these materials for your courses, please fill out this short survey so that we can your efforts.",
    "trimmed_text": "TITLE: Composing Programs || DESCRIPTION: N/A || BODY: c ⚬ mp ⚬ sing pr ⚬ grams Text Projects Tutor About Main Text Projects Tutor About Related Sites CS 61A Course Version 1 Welcome to Composing Programs , a free on introduction to programming and computer science. In the tradition of SICP , this text focuses on methods for abstraction, programming paradigms, and techniques for managing the complexity of large programs. These concepts are illustrated primarily using the Python 3 programming language. In addition to reading the chapters below, you can apply your knowledge to the programming projects that accompany the text and visualize program execution using the On Python Tutor . Instructors : If you are interested in adapting any of these materials for your courses, please fill out this short survey so that we can your efforts. Chapter 1: Building Abstractions with Functions 1.1 Getting Started 1.2 Elements of Programming 1.3 Defining New Functions 1.4 Designing Functions 1.5 Control 1.6 Higher-Order Functions 1.7 Recursive Functions Chapter 2: Building Abstractions with Data 2.1 Introduction 2.2 Data Abstraction 2.3 Sequences 2.4 Mutable Data 2.5 Object-Oriented Programming 2.6 Implementing Classes and Objects 2.7 Object Abstraction 2.8 Efficiency 2.9 Recursive Objects Chapter 3:"
  },
  {
    "url": "https://exercism.org/",
    "name": "Exercism",
    "raw_url": "https://www.exercism.io",
    "length": 200,
    "category": ["Other"],
    "techStack": [
      "Javascript",
      "Python",
      "Java",
      "C++",
      "C#",
      "Ruby",
      "Php",
      "Go",
      "Typescript",
      "Rust"
    ],
    "type": ["Coding Practice"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 90,
    "letterLength": 622,
    "description": "Learn, practice and get world-class mentoring in over 50 languages. Develop fluency in 70 programming languages. Over 6040 coding exercises. From \"Allergies\" to \"Zebra Puzzle\" Exercism is fun, effective and 100% free, forever. for free languages is an independent, community funded, not-for-profit organisation. and get fluent in 70 languages Python 439567 students JavaScript 361201 students Java 175041 students C++ 115090 students Go 114999 students C# 112077 students Rust 102003 students C 93867 students TypeScript 67353 students Bash 58181 students Ruby 52368 students PHP 45037 students See all 70 Language Tracks.",
    "trimmed_text": "TITLE: Exercism || DESCRIPTION: Learn, practice and get world-class mentoring in over 50 languages. 100% free. || BODY: Get really good at programming. Develop fluency in 70 programming languages with our unique blend of learning, practice and mentoring. Exercism is fun, effective and 100% free, forever. for free languages is an independent, community funded, not-for-profit organisation. and get fluent in 70 programming languages Python 439567 students JavaScript 361201 students Java 175041 students C++ 115090 students Go 114999 students C# 112077 students Rust 102003 students C 93867 students TypeScript 67353 students Bash 58181 students Ruby 52368 students PHP 45037 students See all 70 Language Tracks Over 6040 coding exercises. From \"Allergies\" to \"Zebra Puzzle\". Learn by doing. Get better at programming through fun coding exercises that build your understanding of concepts. Allergies Given a person's allergy score, determine whether or not they're allergic to a given item, and their full list of allergies. +40 more Queen Attack Given the position of two queens on a chess board, indicate whether or not they are positioned so that they can attack each other +60 more Zebra Puzzle Which of the residents drinks water? Who owns the zebra? Can you solve the Zebra Puzzle"
  },
  {
    "url": "https://brilliant.org/",
    "name": "Brilliant",
    "raw_url": "http://brilliant.org/",
    "length": 200,
    "category": ["Machine Learning", "Data Analysis"],
    "techStack": ["Other"],
    "type": ["Hands-On Practice", "Interactive Content", "Coding Practice"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 82,
    "letterLength": 522,
    "description": "Learn quantitative skills in math, science, and computer science with hands-on, interactive lessons. Guided interactive problem solving that’s effective and fun. Master concepts in 15 minutes a day. Designed for ages 13 to 113. Over 50,000 5-star reviews on iOS App Store and Google Play Trustpilot. Over 10 million people learning on Brilliant. We make it easy to stay on track, see your progress, and build your problem-solving skills one concept at a time. Our real-time and simple explanations make learning efficient.",
    "trimmed_text": "TITLE: Brilliant | Learn interactively || DESCRIPTION: Brilliant - Build quantitative skills in math, science, and computer science with hands-on, interactive lessons. || BODY: Learn by doing Guided interactive problem solving that’s effective and fun. Master concepts in 15 minutes a day. Math Data Analysis Computer Science Programming & AI Science & Engineering over 10 million people learning on Brilliant Over 50,000 5-star reviews on iOS App Store and Google Play Trustpilot Master concepts in 15 minutes a day Whether you’re a complete beginner or ready to dive into machine learning and beyond, Brilliant makes it easy to level up fast with fun, bite-sized lessons. Effective, hands-on learning Visual, interactive lessons make concepts feel intuitive — so even complex ideas just click. Our real-time and simple explanations make learning efficient. Learn at your level Students and professionals alike can hone dormant skills or learn new ones. Progress through lessons and challenges tailored to your level. Designed for ages 13 to 113. Guided bite-sized lessons We make it easy to stay on track, see your progress, and build your problem-solving skills one concept at a time. Stay motivated Form a real learning habit with fun content that’s always well-paced, game-like progress"
  },
  {
    "url": "https://css-tricks.com",
    "name": "Css-tricks",
    "raw_url": "https://css-tricks.com/snippets/css/a-guide-to-flexbox/",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Javascript", "HTML/CSS"],
    "type": ["Video Courses", "Text-Based"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 78,
    "letterLength": 498,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph. If there is not enough information about the website then return 'Need more details' instead.TITLE: CSS-Tricks - Tips, Tricks, and Techniques on using Cascading Style Sheets. DESCRIPTION: Daily articles about CSS, HTML, JavaScript, and all things related to web design and development. CSS Length Units: A guide covering nine types of lengths that CSS uses to size elements.",
    "trimmed_text": "TITLE: CSS-Tricks - Tips, Tricks, and Techniques on using Cascading Style Sheets. || DESCRIPTION: Daily articles about CSS, HTML, JavaScript, and all things related to web design and development. || BODY: CSS-Tricks Direct link to the article CSS Length Units container units units CSS Length Units A comprehensive guide covering nine types of lengths that CSS uses to size elements in terms of dimensions, space, time, and even sound. Geoff Graham on Jun 3, 2024 Popular this month Powered by DigitalOcean Article on Apr 19, 2024 The Power of :has() in CSS :has CSS Chris DeMars Snippet on Dec 13, 2019 CSS Grid Starter Layouts grid Geoff Graham Video on Feb 25, 2015 #115: Don’t Overthink It Grids ▶ Running Time: 17:19 Chris Coyier Article on Nov 17, 2021 A Clever Sticky Technique sticky sticky Chris Coyier Article on Dec 13, 2022 A Few Times Container Size Queries Would Have ed Me Out container-queries Dan Christofi Article on Jun 11, 2021 A Cornucopia of Container Queries container-queries Geoff Graham Article on Feb 24, 2018 Beginner Concepts: How CSS Selectors Work Chris Coyier Article on Jun 10, 2020 Creative Background Patterns Using Gradients, CSS Shapes, and Even Emojis background gradients patterns"
  },
  {
    "url": "https://www.upgrad.com/my/",
    "name": "Upgrad",
    "raw_url": "https://www.upgrad.com/blog/python-projects-ideas-topics-beginners/](https://www.upgrad.com/blog/python-projects-ideas-topics-beginners/",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Other"],
    "type": ["Other"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 70,
    "letterLength": 496,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph. Ignore the incoherent sentences,any person names, any 'review-like' sentences, any incomplete sentences, and N/A. If there is not enough information about the website then return 'Need more details' instead.TITLE: Education (UG/PG) Programs for Professionals, Online Degree Courses in Malaysia | upGrad. DESCRIPTION: Online Programs and Courses by Top Global Universities.",
    "trimmed_text": "TITLE: Education (UG/PG) Programs for Professionals, Online Degree Courses in Malaysia | upGrad || DESCRIPTION: Online Programs and Courses by Top Global Universities: Unlock your potential with online programs and courses from prestigious global universities. Learn from anywhere in the Malaysia and shape your future. || BODY: Courses Doctorate of Business Administration Back Doctorate of Business Administration Degrees Golden Gate University Bestseller Doctor of Business Administration 36 Months ESGCI Bestseller Doctorate of Business Administration 36 Months Edgewood College Bestseller Doctorate of Business Administration 24 Months Edgewood College Bestseller Dual Degree MBA and DBA 30 Months Golden Gate University Popular Doctor of Business Administration in Emerging Technologies with Concentration in Generative AI 36 Months View More New Launches Golden Gate University New Doctor of Business Administration in Digital Leadership 36 Months View More Education Back Education Degrees Edgewood College Bestseller Doctor of Education (Ed.D) 24 Months View More New Launches Edgewood College New Master of Education (M.Ed.) 14 Months View More MBA Back MBA Degrees Liverpool Business School Bestseller Master of Business Administration (MBA) Liverpool Business School 18 Months Golden Gate University Bestseller Master of Business Administration 15 Months Deakin University Bestseller MBA (Global) Deakin Business School 24 Months IMT Ghaziabad"
  },
  {
    "url": "https://grow.google/intl/uk/courses-and-tools/",
    "name": "LearnDigital",
    "raw_url": "https://learndigital.withgoogle.com/digitalgarage/courses](https://learndigital.withgoogle.com/digitalgarage/courses",
    "length": 200,
    "category": ["Artificial Intelligence", "Cloud Computing"],
    "techStack": ["Other"],
    "type": ["Text-Based", "MOOC", "Coding Practice"],
    "hasCert": true,
    "cost": "Free/Paid",
    "wordLength": 128,
    "letterLength": 818,
    "description": "Grow with Google uses cookies to deliver and enhance the quality of its services and to analyze traffic. If you agree, cookies are also used to serve advertising and to personalize the content and s that you see. Jump to Content the full library of on courses and tools Grow my career Grow my business Filter by Topic Type Certificate Duration Location Filters filter by Topic Artificial intelligence Cloud computing Coding & development Communication Data & analytics Design Digital marketing Digital wellbeing Diversity Expand internationally Job On safety Productivity Sell on Sustainability Type On courses Products & tools Live events 1 to 1 mentoring Guides Articles Certificate Google Career Certificates Other certificates Duration 5 minutes Under 1 hour 1-3 hours 4-10 hours 11-40 hours Over 40 hours Location",
    "trimmed_text": "TITLE: Online Courses and Digital Marketing Training - Google || DESCRIPTION: Explore 80+ online courses and digital training and tools to help you learn new digital skills or help you grow your small business or career. || BODY: Grow with Google uses cookies to deliver and enhance the quality of its services and to analyze traffic. If you agree, cookies are also used to serve advertising and to personalize the content and s that you see. No thanks Agree Jump to Content the full library of on courses and tools Grow my career Grow my business Filter by Topic Type Certificate Duration Location Filters Filter by Topic Artificial intelligence Cloud computing Coding & development Communication Data & analytics Design Digital marketing Digital wellbeing Diversity Expand internationally Job On safety Productivity Sell on Sustainability Type On courses Products & tools Live events 1 to 1 mentoring Guides Articles Certificate Google Career Certificates Other certificates Duration 5 minutes Under 1 hour 1-3 hours 4-10 hours 11-40 hours Over 40 hours Location Glasgow Stalybridge Mitcham Newcastle upon Tyne London Halifax All filters Grow my career Grow my business Topic Artificial intelligence Cloud computing Coding & development Communication Data & analytics Design Digital marketing"
  },
  {
    "url": "https://www.futurelearn.com",
    "name": "Futurelearn",
    "raw_url": "https://www.futurelearn.com/courses/object-oriented-principles?lr=228",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Javascript"],
    "type": ["Video Courses", "MOOC", "Coding Practice"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 82,
    "letterLength": 539,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph. Find online courses and degrees from leading universities or organisations and start learning online today. Get Unlimited and access 1400+ on courses from top universities. Boss it in business with our specialist upskilling courses, industry certifications and high-flying degrees. No matter what your goals are, leading experts from the likes of Accenture, AWS and Deakin University will guide you to achieve them.",
    "trimmed_text": "TITLE: FutureLearn: Online Courses and Degrees from Top Universities || DESCRIPTION: Join millions of people learning on FutureLearn. Find online courses and degrees from leading universities or organisations and start learning online today. || BODY: term Dismiss FutureLearn uses cookies to enhance your experience of the website. All but strictly necessary cookies are currently disabled for this browser. Turn on JavaScript to exercise your cookie preferences for all non-essential cookies. You can read FutureLearn's here . Progress your way 4.58 average rating 184,645 learner reviews Powered by Make your 2024 count. Get Unlimited and access 1400+ on courses from top universities. Get Unlimited learning courses top subjects subjects Business & Management Healthcare & Medicine Teaching Tech & IT Psychology & Mental Health Science, Engineering & Maths Business & Management Boss it in business with our specialist upskilling courses, industry certifications and high-flying degrees. No matter what your goals are, leading experts from the likes of Accenture, AWS and Deakin University will guide you to achieve them. From data analytics to digital marketing, start learning from the best. courses The course was beautifully conceptualised, and well presented. The videos were lucid, clear, articulate and informative. Charles, UK Business & Management Business"
  },
  {
    "url": "https://www.learndatasci.com",
    "name": "Learndatasci",
    "raw_url": "https://www.learndatasci.com/tutorials/ultimate-guide-web-scraping-w-python-requests-and-beautifulsoup/",
    "length": 200,
    "category": ["Machine Learning", "Data Science", "Data Mining", "Sql"],
    "techStack": ["Python", "Sql"],
    "type": ["Text-Based", "Hands-On Practice", "Project-Based"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 97,
    "letterLength": 669,
    "description": "Learn Data Science - Tutorials, Books, Courses, and More – LearnDataSci. Democratizing Data Science, Machine Learning, & AI education. Course & book reviews, tutorials, and projects. We use cookies to operate this website, improve usability, personalize your experience, and improve our marketing. Accept Learn Machine Learning by Doing Learn Now The internet's best courses on: Data Science Machine Learning Python Toggle navigation Daily Learning Curriculum Tutorials Articles Glossary Books Solutions Courses Data Science Data Analytics Machine learning Python SQL Excel AI Team 2.6K 553 Recent Glossary Terms July 28, 2022 Sigmoid Function June 8, 2022 Dot Product.",
    "trimmed_text": "TITLE: Learn Data Science - Tutorials, Books, Courses, and More – LearnDataSci || DESCRIPTION: Democratizing Data Science, Machine Learning, & AI education. Course & book reviews, tutorials, and projects. || BODY: We use cookies to operate this website, improve usability, personalize your experience, and improve our marketing. . By clicking \"Accept\" or further use of this website, you agree to allow cookies. Accept Learn Machine Learning by Doing Learn Now The internet's best courses on: Data Science Machine Learning Python Toggle navigation Daily Learning Curriculum Tutorials Articles Glossary Books Solutions Courses Data Science Data Analytics Machine Learning Python SQL Excel AI Team 2.6K 553 Recent Glossary Terms July 28, 2022 Sigmoid Function June 8, 2022 Dot Product Sept. 26, 2021 Hierarchical Clustering July 21, 2021 Cosine Similarity July 19, 2021 Precision and Recall May 20, 2022 Orthogonal and Orthonormal Vectors May 1, 2021 Binary Classification April 6, 2021 TF-IDF — Term Frequency-Inverse Document Frequency Data Science jobs last 30 days Loading... data from indeed.com Popular Articles Tutorials The Ultimate Guide to Web Scraping Tutorials Part 1 - Python For Finance Tutorials Reinforcement with Q-Learning New Courses AI in Healthcare A new Specialization that teaches data mining and machine learning in"
  },
  {
    "url": "https://learnjavascript.online",
    "name": "Learnjavascript",
    "raw_url": "https://learnjavascript.online/",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Javascript"],
    "type": ["Hands-On Practice", "Project-Based", "Interactive Content"],
    "hasCert": false,
    "cost": "Paid",
    "wordLength": 90,
    "letterLength": 551,
    "description": "Learn modern JavaScript (ES2015+) from scratch, and practice in an intuitive environment. The challenges are inspired by real-world projects to make sure that you're learning the best practices, one step at a time. Learn Javascript is suitable for beginner developers who have basic experience in any programming language. It is the best way to learn JavaScript in 2024. Try the first 77 lessons, challenges, projects (first 7 chapters) & flashcards for free. You can upgrade to a Pro account with a one-time payment that gives you access for 5 years.",
    "trimmed_text": "TITLE: Learn JavaScript || DESCRIPTION: Learn JavaScript is the easiest, most interactive way to learn & practice modern JavaScript online. Read short lessons, solve challenges & answer flashcards. || BODY: Learn JavaScript The easiest way to learn & practice modern JavaScript Learn in an interactive environment. Read short lessons, take notes, and complete challenges directly in your browser. Try it out → Anonymous cookies are used to improve the quality of the course. It's time to learn practical JavaScript the modern way Learn modern JavaScript (ES2015+) from scratch, and practice in an intuitive environment. The challenges are inspired by real-world projects to make sure that you're learning the best practices, one step at a time. Try the first 77 lessons, challenges, projects (first 7 chapters) & flashcards for free. You can upgrade to a Pro account with a one-time payment that gives you access for 5 years. Learn Javascript is suitable for beginner developers who have basic experience in any programming language. Not comfortable with the basics? Then consider Learn Programming which covers the basics. What you will learn This course covers the fundamentals of JavaScript. It is the best way to learn JavaScript in 2024. The lessons & challenges"
  },
  {
    "url": "https://inside.java",
    "name": "Inside.Java",
    "raw_url": "https://inside.java/2020/08/05/textblocks-programmer-guide/",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Java", "Spring"],
    "type": ["Other"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 83,
    "letterLength": 521,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph. Ignore the incoherent sentences,any person names, any 'review-like' sentences, any incomplete sentences, and N/A. If there is not enough information about the website then return 'Need more details' instead of the text. The text is broken up into two sections: inside.java and body.java. Inside.java: News and views from members of the Java team at Oracle. Body: Inside Java News: Sip of Java dev.",
    "trimmed_text": "TITLE: Inside.java || DESCRIPTION: News and views from members of the Java team at Oracle || BODY: Inside Java News and views from members of the Java team at Oracle Newscast &nbsp&nbsp Podcast &nbsp&nbsp JEP Café &nbsp&nbsp Sip of Java dev.java &nbsp&nbsp &nbsp&nbsp About &nbsp&nbsp Jobs Sort by: Date Author Tag Java SE Spring 2024 Roadmap Update Donald Smith on June 8, 2024 Oracle Introducing Oracle Code Assist Aanand Krishnan (guest) on June 7, 2024 Oracle All Java 23 Features Nicolai Parlog on June 6, 2024 JDK 23 Separate Operations From Data - DOP v1.1 Nicolai Parlog on June 5, 2024 Java Language Amber JEP targeted to JDK 23: 481: Scoped Values (3rd Preview) Andrew Haley (guest) on June 4, 2024 JDK 23 Loom JEP targeted to JDK 23: 471: Deprecate the Memory-Access Methods in sun.misc.Unsafe for Removal Ron Pressler , Alex Buckley on June 4, 2024 JDK 23 Make Illegal States Unrepresentable - DOP v1.1 Nicolai Parlog on June 3, 2024 Java Language Amber JEP targeted to JDK 23: 480: Structured Concurrency (Third Preview) Ron Pressler , Alan Bateman on June 2, 2024 JDK 23 Loom Java in 2024 - Constant evolution, delivered. Georges Saab , Chad Arimura on"
  },
  {
    "url": "https://devopswithkubernetes.com",
    "name": "Devopswithkubernetes",
    "raw_url": "https://devopswithkubernetes.com/",
    "length": 200,
    "category": ["Devops", "Software Development"],
    "techStack": ["Other"],
    "type": ["MOOC"],
    "hasCert": true,
    "cost": "Free",
    "wordLength": 84,
    "letterLength": 526,
    "description": "DevOps with Kubernetes is a free MOOC created by the University of Helsinki. The 2024 edition has started unofficially. The official start is 1st August, the university credits will not be awarded before that. In this course, you will develop software with a microservice architecture. Learn how to serve software that scales and deploys automatically. And learn how to manage it all. This course can not be completed with the faculty computers. Attendees need to provide their own computers with admin / superuser privileges.",
    "trimmed_text": "TITLE: Homepage - DevOps with Kubernetes || DESCRIPTION: DevOps with Kubernetes is a free MOOC created by the University of Helsinki where you can learn how to deploy, manage and monitor software in Kubernetes. || BODY: Avaa valikko DevOps with Kubernetes MOOC.fi Create new account DevOps with Kubernetes Introduction to Kubernetes practices page The course material has now been updated and the 2024 edition has started unofficially. The official start is 1st August, the university credits will not be awarded before that This course is an introductory course to Kubernetes with K3s and GKE. In this course, you will develop software with a microservice architecture that utilizes Kubernetes to serve software that scales and deploys automatically. And learn how to manage it all. This course can not be completed with the faculty computers. Attendees need to provide their own computers with admin / superuser privileges. Course details and starting instructions can be found in part 0 . Registration is only required for ECTS credits. The certificate does not require registration or separate . The following are suggestions on what you should complete before ing the course. These are not mandatory, but it's recommended that you.. are familiar with containers (probably"
  },
  {
    "url": "https://devopswithdocker.com",
    "name": "Devopswithdocker",
    "raw_url": "https://devopswithdocker.com/",
    "length": 200,
    "category": [
      "Databases",
      "Software Development",
      "Devops",
      "Software Development"
    ],
    "techStack": ["Other"],
    "type": ["Coding Practice"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 93,
    "letterLength": 618,
    "description": "This course provides an introduction to container technologies, with a particular focus on Docker and container orchestration using Docker Compose. Containers are a lightweight, portable way to package and deploy software applications. Throughout the course, we'll explore the various components of web services, such as reverse proxies and databases, and how they can be deployed using Docker. Please note that due to technical limitations, Docker cannot be installed on Department of Computer Science computers. You will need to use your own computer to follow the examples and complete the exercises in this course.",
    "trimmed_text": "TITLE: DevOps with Docker | DevOps with Docker || DESCRIPTION: This course provides an introduction to container technologies, with a particular focus on Docker and container orchestration using Docker Compose. Containers are a lightweight, portable way to package and deploy software applications. Throughout the course, we'll explore the various components of web services, such as reverse proxies and databases, and how they can be deployed using Docker. || BODY: DevOps with Docker Containers for Beginners This course provides an introduction to container technologies, with a particular focus on Docker and container orchestration using Docker Compose. Containers are a lightweight, portable way to package and deploy software applications. Throughout the course, we'll the various components of web services, such as reverse proxies and databases, and how they can be deployed using Docker. Please note that due to technical limitations, Docker cannot be installed on Department of Computer Science computers. As a result, you will need to use your own computer to follow the examples and complete the exercises in this course. Prerequisites ​ To be successful in this course, attendees should have access to a computer with admin/superuser privileges. Attendees should also have a general understanding of software development concepts and"
  },
  {
    "url": "https://www.codechef.com/",
    "name": "Codechef",
    "raw_url": "http://codechef.com/",
    "length": 200,
    "category": ["Sql", "Web Development", "Data Structures"],
    "techStack": ["Javascript", "Python", "Java", "C++", "Sql"],
    "type": ["Hands-On Practice", "Interactive Content", "Coding Practice"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 78,
    "letterLength": 494,
    "description": "Learn coding with our free and beginner friendly courses on Python, Java, C, C++, Data structures, Algorithms, SQL. Solve our collection of 1000s of problems to practice coding. Learn to code from scratch with job focussed courses designed by experts. Start learning today. Please enter a valid email address to continue or with Google Github Learn tocode Beginner Learn Python Get hands-on experience and master the basic syntax of Python to jumpstart your coding journey 114.4k+ learners 4.6.",
    "trimmed_text": "TITLE: CodeChef - Learn and Practice Coding with Problems || DESCRIPTION: Learn coding with our free and beginner friendly courses on Python, Java, C, C++, Data structures, Algorithms, SQL. Solve our collection of 1000s of problems to practice coding. || BODY: Courses Learn Python 10 courses Learn C++ 9 courses Learn C 9 courses Learn Java 9 courses Learn Javascript 9 courses Data Structures 9 courses Master Algorithms 10 courses Learn SQL 7 courses Web Development 5 courses Practice Compete Upgrade to Pro / Courses Learn Python 10 courses Learn C++ 9 courses Learn C 9 courses Learn Java 9 courses Learn Javascript 9 courses Data Structures 9 courses Master Algorithms 10 courses Learn SQL 7 courses Web Development 5 courses Practice Compete Start your coding journey today Learn to code from scratch with job focussed courses designed by experts. Start learning today Please enter a valid email address to continue or with Google Github Learn to code Beginner Learn Python Get hands-on experience and master the basic syntax of Python to jumpstart your coding journey 114.4k+ learners 4.6 View this Course Beginner Learn Java Get hands-on experience in Java programming with this interactive and practical course 77.6k+ learners 4.7"
  },
  {
    "url": "https://www.learncs.org",
    "name": "Learncs",
    "raw_url": "https://www.learncs.org/",
    "length": 200,
    "category": ["Other"],
    "techStack": ["C#"],
    "type": ["Interactive Content", "Coding Practice"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 91,
    "letterLength": 568,
    "description": "Learn C# is a free interactive C# tutorial for people who want to learn C#, fast. Just click on the chapter you wish to begin from, and follow the instructions. Coding for Kids is an on interactive tutorial that teaches your kids how to code while playing! Receive a 50% code by using the code: 2FRHUGWXF0 Start now. Learn the Basics Hello, World! User Input Variables and Types Type Conversion Conditionals Arrays Lists Dictionaries Strings For loops Foreach loops While loops Methods Basic Classes Class Variables Class Properties Contributing Tutorials learncs.org.",
    "trimmed_text": "TITLE: Learn C# - Free Interactive C# Tutorial || DESCRIPTION: learncs.org is a free interactive C# tutorial for people who want to learn C#, fast. || BODY: Welcome Welcome to the learncs.org free interactive C# tutorial. Whether you are an experienced programmer or not, this website is intended for everyone who wishes to learn the C# programming language. There is no need to anything - Just click on the chapter you wish to begin from, and follow the instructions. Good luck! learncs.org is still under construction - If you wish to contribute tutorials, please click on Contributing Tutorials down below. Learn the Basics Hello, World! User Input Variables and Types Type Conversion Conditionals Arrays Lists Dictionaries Strings For loops Foreach loops While loops Methods Basic Classes Class Variables Class Properties Contributing Tutorials here: Contributing Tutorials Start Exercise Sponsors Chapters Hello, World! User Input Variables and Types Type Conversion Conditionals Arrays Lists Dictionaries Strings For loops Foreach loops While loops Methods Basic Classes Class Variables Class Properties Contributing Tutorials learncs.org. Read our and Coding for Kids is an on interactive tutorial that teaches your kids how to code while playing! Receive a 50% code by using the code: 2FRHUGWXF0 Start now"
  },
  {
    "url": "https://realpython.com",
    "name": "Realpython",
    "raw_url": "https://realpython.com/free-courses-march-2020",
    "length": 200,
    "category": ["Databases", "Devops"],
    "techStack": ["Python", "Django", "Flask"],
    "type": [
      "Video Courses",
      "Text-Based",
      "Hands-On Practice",
      "Project-Based",
      "Interactive Content"
    ],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 85,
    "letterLength": 518,
    "description": "Learn about the main tools for string Formatting in Python. These tools include f-strings, the .format() method, and the modulo operator. Use the weekly Newsquiz to test your knowledge of stories you saw on CNN.com. You can also use the Daily Discussion to help you understand today's featured news stories. The Daily Discussion has been updated to include the latest news about the Real Python Podcast and the Python Book Club. The Real Python podcast is available on iTunes, Amazon, Google Play, and other retailers.",
    "trimmed_text": "TITLE: Python Tutorials – Real Python || DESCRIPTION: Learn Python online: Python tutorials for developers of all skill levels, Python books and courses, Python news, code examples, articles, and more. || BODY: Real Python Tutorials NEW Python String Formatting: Available Tools and Their Features In this tutorial, you'll learn about the main tools for string formatting in Python, as well as their strengths and weaknesses. These tools include f-strings, the .format() method, and the modulo operator. Jun 05, 2024 basics best-practices python — FREE Email Series — 🐍 Python Tricks 💌 Get Python Tricks » 🔒 No spam. Un any time. Browse Topics Guided Learning Paths Basics Intermediate Advanced api best-practices career community databases data-science data-structures data-viz devops django docker editors flask front-end gamedev gui machine-learning numpy projects python testing tools web-dev web-scraping Real Python Learning Paths Guided study plans for accelerated learning Python Tutorials In-depth articles and step-by-step video courses Quizzes Evaluate your Python knowledge with quick tests Browse Topics Focus on a specific area or skill level Community Chat Learn with other Pythonistas Office Hours Live Q&A calls with experts from Real Python Podcast Hear what’s new in the world of Python Books Round out your knowledge and"
  },
  {
    "url": "https://javascript.info",
    "name": "Javascript",
    "raw_url": "https://javascript.info/",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Javascript", "Go"],
    "type": ["Text-Based", "Hands-On Practice", "Project-Based"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 80,
    "letterLength": 517,
    "description": "This is a text of a website generated using scrapy. If there is not enough information about the website then return 'Need more details' instead. We want to make this open-source project available for people all around the world. to translate the content of this tutorial to your language! Buy EPUB/PDF Tutorial map Light theme Dark theme Share  ‘The Modern JavaScript Tutorial: simple, but detailed explanations with examples and tasks, including: closures, document and events, object oriented programming and more.",
    "trimmed_text": "TITLE: The Modern JavaScript Tutorial || DESCRIPTION: Modern JavaScript Tutorial: simple, but detailed explanations with examples and tasks, including: closures, document and events, object oriented programming and more. || BODY: EN AR عربي EN English ES Español FA فارسی FR Français ID Indonesia IT Italiano JA 日本語 KO 한국어 RU Русский TR Türkçe UK Українська ZH 简体中文 We want to make this open-source project available for people all around the world. to translate the content of this tutorial to your language! Buy EPUB/PDF Tutorial map Light theme Dark theme Share عربي English Español فارسی Français Indonesia Italiano 日本語 한국어 Русский Türkçe Українська 简体中文 The Modern JavaScript Tutorial How it's done now. From the basics to advanced topics with simple, but detailed explanations. Last June 8, 2024 Buy EPUB/PDF Share: 22887 ★ github Chat Table of contents Main course contains 2 parts which cover JavaScript as a programming language and working with a browser. There are also additional series of thematic articles. The JavaScript language Here we learn JavaScript, starting from scratch and go on to advanced concepts like OOP. We concentrate on the language itself here, with the minimum of environment-specific notes. An introduction An Introduction to JavaScript Manuals and"
  },
  {
    "url": "https://openedx.seas.gwu.edu/",
    "name": "Gwu",
    "raw_url": "http://openedx.seas.gwu.edu/courses/GW/MAE6286/2014_fall/about",
    "length": 11,
    "category": ["Other"],
    "techStack": ["Other"],
    "type": ["Other"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 79,
    "letterLength": 477,
    "description": "This is a text of a website generated using scrapy. Please summarize the following text into a concise, readable paragraph. Ignore the incoherent sentences,any person names, any 'review-like' sentences, any incomplete sentences, and N/A. If there is not enough information about the website then return 'Need more details' instead of 'This is an example of what you can expect from this website. I am not responsible for the content of this website or any of the content on it.",
    "trimmed_text": "TITLE: | GW Open edX || DESCRIPTION: N/A || BODY: N/A"
  },
  {
    "url": "https://www.bigocheatsheet.com/",
    "name": "Bigocheatsheet",
    "raw_url": "http://bigocheatsheet.com",
    "length": 200,
    "category": ["Other"],
    "techStack": ["React.js"],
    "type": ["Other"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 90,
    "letterLength": 551,
    "description": "This webpage covers the space and time Big-O complexities of common algorithms used in Computer Science. It was created by Eric Drowell to help him prepare for technical interviews. It includes the best, average, and worst case complexities for and sorting algorithms so that he wouldn't be stumped when asked about them. The webpage is available as a PDF and can be downloaded by clicking the 'download' button below. The website is generated using scrapy. If there is not enough information about the website then return 'Need more details' instead.",
    "trimmed_text": "TITLE: Big-O Algorithm Complexity Cheat Sheet (Know Thy Complexities!) @ericdrowell || DESCRIPTION: N/A || BODY: Big-O Cheat Sheet PDF Know Thy Complexities! Hi there! This webpage covers the space and time Big-O complexities of common algorithms used in Computer Science. When preparing for technical interviews in the past, I found myself spending hours crawling the internet putting together the best, average, and worst case complexities for and sorting algorithms so that I wouldn't be stumped when asked about them. Over the last few years, I've interviewed at several Sil Valley startups, and also some bigger companies, like Google, , Yahoo, , and Uber, and each time that I prepared for an interview, I thought to myself \"Why hasn't someone created a nice Big-O cheat sheet?\". So, to save all of you fine folks a ton of time, I went ahead and created one. Enjoy! - Eric AngularJS to React Automated Migration Big-O Complexity Chart Horrible Bad Fair Good Excellent O(log n), O(1) O(n) O(n log n) O(n^2) O(2^n) O(n!) Operations Elements Common Data Structure Operations Data Structure Time Complexity Space Complexity Average Worst Worst Access Insertion Deletion Access Insertion Deletion Array Θ(1) Θ(n) Θ(n) Θ(n) O(1) O(n) O(n) O(n) O(n)"
  },
  {
    "url": "https://ionicacademy.com/",
    "name": "Ionicacademy",
    "raw_url": "http://ionicacademy.com/",
    "length": 200,
    "category": ["Sql"],
    "techStack": ["Other"],
    "type": ["Video Courses"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 89,
    "letterLength": 574,
    "description": "Learn Ionic fast with step-by-step video courses and join our private community today. Build on your existing skills and understand what it takes to build and release native mobile apps. Structure apps with tabs or s, understand navigation and state management and create beautiful UIs with the Ionic Framework. Work with Capacitor Add native features like Camera, Push Notifications or SQLite storage to any web app and integrate native plugins. Release Native Apps Build powerful features, prepare you apps for iOS and Android and releasenative apps with web technologies.",
    "trimmed_text": "TITLE: Learn Ionic FAST || DESCRIPTION: Whether it’s for work or launching your own app - learn Ionic fast with step-by-step video courses and join our private community today. || BODY: The fastest way to learn Ionic 🚀 Whether it’s for work, launching your own app or getting more jobs - learn Ionic quickly with step-by-step video courses and our private today. Simon Grimm now 60+ Courses · 18+ App Templates · 5000+ Students · Private · 14 day money back guarantee Turning web developers into Ionic experts. Build on your existing skills and understand what it takes to build and release native mobile apps. Learn Ionic Structure apps with tabs or s, understand navigation and state management and create beautiful UIs with the Ionic Framework. Work with Capacitor Add native features like Camera, Push Notifications or SQLite storage to any web app and integrate native plugins. Release Native Apps Build powerful features, prepare you apps for iOS and Android and release native apps with web technologies. Never miss the critical step. Dive into step-by-step video courses covering every aspect of Ionic, Capacitor and features your app needs. Check out our course library Be a part of our community. Get"
  },
  {
    "url": "https://www.kodeco.com/",
    "name": "Kodeco",
    "raw_url": "https://www.kodeco.com/",
    "length": 200,
    "category": ["Mobile Development"],
    "techStack": ["Javascript", "Swift", "Kotlin", "Dart", "Flutter"],
    "type": ["Video Courses", "Text-Based"],
    "hasCert": false,
    "cost": "Paid",
    "wordLength": 81,
    "letterLength": 522,
    "description": "Learn iOS and Swift, Android and Kotlin & Dart and Flutter development with the largest and highest-quality catalog of video courses and books on the Internet. Make building mobile apps easy with Kodeco. The best investment for your mobile development career. Personal subscriptions on for 1 week only! Save up to 35%! Kodeco requires JavaScript. Please enable JavaScript to enjoy the best experience. The new raywenderlich.com is open. Toggle night mode Start for free. Celebrate learning with Kod eco's flash graduation.",
    "trimmed_text": "TITLE: Kodeco | Learn iOS, Android & Flutter || DESCRIPTION: Learn iOS and Swift, Android and Kotlin & Dart and Flutter development with the largest and highest-quality catalog of video courses and books on the Internet. || BODY: Group Group Group Group Group Group Group Group Group Group Shape Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Group Open The new raywenderlich.com Open The new raywenderlich.com Start for free Toggle night mode Start for free Celebrate learning with Kodeco's flash graduation ! Personal subscriptions on for 1 week only! Save up to 35%! Kodeco requires JavaScript. Please enable JavaScript to enjoy the best experience. The best investment for your mobile development career Learn iOS and Swift, Android and Kotlin & Dart and Flutter development with the largest and highest-quality catalog of video courses and books on the Internet. Make building mobile apps easy with Kodeco. It's tough to keep up with mobile development these days. Constantly-changing platforms, libraries, frameworks, and more make it challenging to stay at the top of your game. With"
  },
  {
    "url": "https://codegym.cc",
    "name": "Codegym",
    "raw_url": "https://codegym.cc/",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Java"],
    "type": ["MOOC", "Coding Practice"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 80,
    "letterLength": 475,
    "description": "Learn Java - Online Java Course. For beginners and for experienced programmers. Contains a Java tutorial and 1200 Java practice tasks. You can code. No matter your age, knowledge, or origin. It's like riding a bicycle: all you need is to practice. Practice in Java coding without pressure, at your pace, from the first lessons. Try to learn Java with us! 4.8 57 reviews 4.9 63 reviews 4,9 1,600+ reviews. Start Get the personalized training program based on your preferences.",
    "trimmed_text": "TITLE: Learn Java - Online Java Course || DESCRIPTION: CodeGym is an online course to learn Java. For beginners and for experienced programmers. Contains a Java tutorial and 1200 Java practice tasks! || BODY: About the course Features Training format Reviews Media Start Start Learning You can code once you try it with CodeGym Learn Java On in a Fun Way You can code. No matter your age, knowledge, or origin. It's like riding a bicycle: all you need is to practice. And CodeGym, the on Java programming course, is your bicycle with training wheels. Practice in Java coding without pressure, at your pace, from the first lessons. Try to learn Java with us! 4.8 57 reviews 4.9 63 reviews 4.9 1,600+ reviews I’m on it – Let’s start I’m on it – Let’s start About the course What is learning Java with CodeGym be like? You get an exciting training experience CodeGym isn’t just a learning course, it’s a game. You upgrade your “player character” to new levels, open new quests, and get achievements. Once you start, you move towards the destination point – Yourself as a Coding Pro. Start Get the personalized training program based on your preferences"
  },
  {
    "url": "https://teamtreehouse.com",
    "name": "Teamtreehouse",
    "raw_url": "https://teamtreehouse.com",
    "length": 200,
    "category": ["Data Science", "UX Design"],
    "techStack": ["Python", "React.js"],
    "type": ["Video Courses", "Coding Practice"],
    "hasCert": false,
    "cost": "Free",
    "wordLength": 74,
    "letterLength": 443,
    "description": "Learn AI, Data Science, Python, and React. Learn languages, frameworks, and principles required for the most in-demand topics. Find all the instructions you need to get an entry-level job in tech, even if you’ve never coded. Learn to code, design, and more—all on your own time. Try it free for 7 days , then $25 a month. Now Techdegree Courses Businesses Plans Computer with Play Expert-led video courses for beginners and other skill levels.",
    "trimmed_text": "TITLE: Learn to Code Online | Treehouse || DESCRIPTION: Sign up for expert-led video courses to start your journey into coding, programming, and design. Perfect for beginners, intermediate, and advanced learners. || BODY: 🙏 Thank you CodeForward sponsor, Tower—the best Git client out there! Get 25% off with coupon code TREEHOUSE25 . 💛 our Live Session: Launch Your UX Career! 🐸 Register here! our free community server here! 🤖 Our latest AI course, Intro to NLP, is all yours! Check it out. 🐸 What's happening at Treehouse? 💚 Learn AI, Data Science, Python, and React Learn to code, design, and more—all on your own time Try it free for 7 days , then $25 a month Email I want to hear from Treehouse about products and services. Now Techdegree Courses Businesses Plans Computer with Play Expert-led video courses for beginners and other skill levels Find all the instructions you need to get an entry-level job in tech, even if you’ve never coded. Not a beginner? Test out of subjects you already know with Compass. Puzzle Piece In-demand topics for Developers and Designers Stay up to date with your skills. Learn the languages, frameworks, and principles required for the most in-demand"
  },
  {
    "url": "https://www.kadenze.com",
    "name": "Kadenze",
    "raw_url": "https://www.kadenze.com/courses/machine-learning-for-musicians-and-artists/info",
    "length": 200,
    "category": ["Other"],
    "techStack": ["Other"],
    "type": ["Other"],
    "hasCert": false,
    "cost": "Free/Paid",
    "wordLength": 80,
    "letterLength": 510,
    "description": "Kadenze brings together educators, artists, and engineers from leading universities to provide world-class education in the fields of art and creative technology. Enroll Become a student of the kadenze.com community and enjoy access to the courses in our catalog, and much more. Today & Start Learning For Life With Email With With Google With Microsoft Created by potrace 1.16, written by Peter Selinger 2001-2019 With Clever Create an Account * Email * Password Remember Me Create An Account Forgot Password?",
    "trimmed_text": "TITLE: Online Creative Courses from Top Universities | Kadenze || DESCRIPTION: Kadenze brings together educators, artists, and engineers from leading universities to provide world-class education in the fields of art and creative technology. Email us at communications@kadenze.com or call us at (661) 367-1361 || BODY: ? Let's get this experience started Register With Email Register With Register With Google Register With Microsoft Created by potrace 1.16, written by Peter Selinger 2001-2019 Register With Clever * First name * Last name * Email * Password * Password confirmation Have a Coupon Code? By signing up you agree to kadenze’s and Already a member? DISCOVER YOUR CREATIVE EDUCATION kadenze.com to take on courses from the world's leading universities, brands, and institutions in creative education. Today & Start Learning For Life With Email With With Google With Microsoft Created by potrace 1.16, written by Peter Selinger 2001-2019 With Clever Create An Account * Email * Password Remember Me Create An Account Forgot Password? FIND CREATIVE COURSES THAT INSPIRE YOU {{category}} BROWSE COURSES UNIVERSITY & BRAND PARTNERS All Partners THE EXPERIENCE Enroll Become a student of the kadenze.com community and enjoy access to the courses in our catalog, and much more. Register Here A"
  }
]
